Model: "model_1"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         (None, 320, 5, 8, 1)      0         
_________________________________________________________________
pad (ZeroPadding3D)          (None, 400, 5, 8, 1)      0         
_________________________________________________________________
conv3d_1 (Conv3D)            (None, 381, 1, 8, 16)     1616      
_________________________________________________________________
zero_padding3d_1 (ZeroPaddin (None, 400, 1, 8, 16)     0         
_________________________________________________________________
max_pooling3d_1 (MaxPooling3 (None, 200, 1, 8, 16)     0         
_________________________________________________________________
conv3d_2 (Conv3D)            (None, 191, 1, 1, 16)     20496     
_________________________________________________________________
zero_padding3d_2 (ZeroPaddin (None, 200, 1, 1, 16)     0         
_________________________________________________________________
max_pooling3d_2 (MaxPooling3 (None, 100, 1, 1, 16)     0         
_________________________________________________________________
lambda_1 (Lambda)            (None, 100, 16)           0         
_________________________________________________________________
dense_1 (Dense)              (None, 100, 64)           1088      
_________________________________________________________________
dropout_1 (Dropout)          (None, 100, 64)           0         
_________________________________________________________________
dense_2 (Dense)              (None, 100, 64)           4160      
_________________________________________________________________
dropout_2 (Dropout)          (None, 100, 64)           0         
_________________________________________________________________
dense_3 (Dense)              (None, 100, 64)           4160      
_________________________________________________________________
dropout_3 (Dropout)          (None, 100, 64)           0         
_________________________________________________________________
encoded (Dense)              (None, 100, 64)           4160      
_________________________________________________________________
lambda_2 (Lambda)            (None, 100, 64, 1, 1)     0         
_________________________________________________________________
conv3d_3 (Conv3D)            (None, 81, 1, 1, 16)      20496     
_________________________________________________________________
zero_padding3d_3 (ZeroPaddin (None, 100, 1, 1, 16)     0         
_________________________________________________________________
up_sampling3d_1 (UpSampling3 (None, 200, 1, 1, 16)     0         
_________________________________________________________________
up_sampling3d_2 (UpSampling3 (None, 400, 1, 1, 16)     0         
_________________________________________________________________
conv3d_4 (Conv3D)            (None, 400, 1, 1, 40)     12840     
_________________________________________________________________
lambda_3 (Lambda)            (None, 400, 40)           0         
_________________________________________________________________
lambda_4 (Lambda)            (None, 400, 5, 8)         0         
_________________________________________________________________
lambda_5 (Lambda)            (None, 400, 5, 8, 1)      0         
_________________________________________________________________
unpad (Lambda)               (None, 320, 5, 8, 1)      0         
=================================================================
Total params: 69,016
Trainable params: 69,016
Non-trainable params: 0
_________________________________________________________________
