Model: "model_1"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         (None, 320, 12, 17, 1)    0         
_________________________________________________________________
pad (ZeroPadding3D)          (None, 400, 12, 17, 1)    0         
_________________________________________________________________
conv3d_1 (Conv3D)            (None, 381, 1, 17, 32)    7712      
_________________________________________________________________
zero_padding3d_1 (ZeroPaddin (None, 400, 1, 17, 32)    0         
_________________________________________________________________
max_pooling3d_1 (MaxPooling3 (None, 200, 1, 17, 32)    0         
_________________________________________________________________
conv3d_2 (Conv3D)            (None, 191, 1, 1, 32)     174112    
_________________________________________________________________
zero_padding3d_2 (ZeroPaddin (None, 200, 1, 1, 32)     0         
_________________________________________________________________
max_pooling3d_2 (MaxPooling3 (None, 100, 1, 1, 32)     0         
_________________________________________________________________
lambda_1 (Lambda)            (None, 100, 32)           0         
_________________________________________________________________
dense_1 (Dense)              (None, 100, 256)          8448      
_________________________________________________________________
dropout_1 (Dropout)          (None, 100, 256)          0         
_________________________________________________________________
dense_2 (Dense)              (None, 100, 256)          65792     
_________________________________________________________________
dropout_2 (Dropout)          (None, 100, 256)          0         
_________________________________________________________________
dense_3 (Dense)              (None, 100, 256)          65792     
_________________________________________________________________
dropout_3 (Dropout)          (None, 100, 256)          0         
_________________________________________________________________
encoded (Dense)              (None, 100, 256)          65792     
_________________________________________________________________
lambda_2 (Lambda)            (None, 100, 256, 1, 1)    0         
_________________________________________________________________
conv3d_3 (Conv3D)            (None, 81, 1, 1, 32)      163872    
_________________________________________________________________
zero_padding3d_3 (ZeroPaddin (None, 100, 1, 1, 32)     0         
_________________________________________________________________
up_sampling3d_1 (UpSampling3 (None, 200, 1, 1, 32)     0         
_________________________________________________________________
up_sampling3d_2 (UpSampling3 (None, 400, 1, 1, 32)     0         
_________________________________________________________________
conv3d_4 (Conv3D)            (None, 400, 1, 1, 204)    130764    
_________________________________________________________________
lambda_3 (Lambda)            (None, 400, 204)          0         
_________________________________________________________________
lambda_4 (Lambda)            (None, 400, 12, 17)       0         
_________________________________________________________________
lambda_5 (Lambda)            (None, 400, 12, 17, 1)    0         
_________________________________________________________________
unpad (Lambda)               (None, 320, 12, 17, 1)    0         
=================================================================
Total params: 682,284
Trainable params: 682,284
Non-trainable params: 0
_________________________________________________________________
