Model: "model_1"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         (None, 320, 67, 20, 1)    0         
_________________________________________________________________
pad (ZeroPadding3D)          (None, 400, 67, 20, 1)    0         
_________________________________________________________________
conv3d_1 (Conv3D)            (None, 381, 1, 20, 128)   171648    
_________________________________________________________________
zero_padding3d_1 (ZeroPaddin (None, 400, 1, 20, 128)   0         
_________________________________________________________________
max_pooling3d_1 (MaxPooling3 (None, 200, 1, 20, 128)   0         
_________________________________________________________________
conv3d_2 (Conv3D)            (None, 191, 1, 1, 128)    3276928   
_________________________________________________________________
zero_padding3d_2 (ZeroPaddin (None, 200, 1, 1, 128)    0         
_________________________________________________________________
max_pooling3d_2 (MaxPooling3 (None, 100, 1, 1, 128)    0         
_________________________________________________________________
lambda_1 (Lambda)            (None, 100, 128)          0         
_________________________________________________________________
dense_1 (Dense)              (None, 100, 2048)         264192    
_________________________________________________________________
dropout_1 (Dropout)          (None, 100, 2048)         0         
_________________________________________________________________
dense_2 (Dense)              (None, 100, 2048)         4196352   
_________________________________________________________________
dropout_2 (Dropout)          (None, 100, 2048)         0         
_________________________________________________________________
dense_3 (Dense)              (None, 100, 2048)         4196352   
_________________________________________________________________
dropout_3 (Dropout)          (None, 100, 2048)         0         
_________________________________________________________________
encoded (Dense)              (None, 100, 2048)         4196352   
_________________________________________________________________
lambda_2 (Lambda)            (None, 100, 2048, 1, 1)   0         
_________________________________________________________________
conv3d_3 (Conv3D)            (None, 81, 1, 1, 128)     5243008   
_________________________________________________________________
zero_padding3d_3 (ZeroPaddin (None, 100, 1, 1, 128)    0         
_________________________________________________________________
up_sampling3d_1 (UpSampling3 (None, 200, 1, 1, 128)    0         
_________________________________________________________________
up_sampling3d_2 (UpSampling3 (None, 400, 1, 1, 128)    0         
_________________________________________________________________
conv3d_4 (Conv3D)            (None, 400, 1, 1, 1340)   3431740   
_________________________________________________________________
lambda_3 (Lambda)            (None, 400, 1340)         0         
_________________________________________________________________
lambda_4 (Lambda)            (None, 400, 67, 20)       0         
_________________________________________________________________
lambda_5 (Lambda)            (None, 400, 67, 20, 1)    0         
_________________________________________________________________
unpad (Lambda)               (None, 320, 67, 20, 1)    0         
=================================================================
Total params: 24,976,572
Trainable params: 24,976,572
Non-trainable params: 0
_________________________________________________________________
