Model: "model_1"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         (None, 320, 48, 19, 1)    0         
_________________________________________________________________
pad (ZeroPadding3D)          (None, 400, 48, 19, 1)    0         
_________________________________________________________________
conv3d_1 (Conv3D)            (None, 381, 1, 19, 64)    61504     
_________________________________________________________________
zero_padding3d_1 (ZeroPaddin (None, 400, 1, 19, 64)    0         
_________________________________________________________________
max_pooling3d_1 (MaxPooling3 (None, 200, 1, 19, 64)    0         
_________________________________________________________________
conv3d_2 (Conv3D)            (None, 191, 1, 1, 64)     778304    
_________________________________________________________________
zero_padding3d_2 (ZeroPaddin (None, 200, 1, 1, 64)     0         
_________________________________________________________________
max_pooling3d_2 (MaxPooling3 (None, 100, 1, 1, 64)     0         
_________________________________________________________________
lambda_1 (Lambda)            (None, 100, 64)           0         
_________________________________________________________________
dense_1 (Dense)              (None, 100, 1024)         66560     
_________________________________________________________________
dropout_1 (Dropout)          (None, 100, 1024)         0         
_________________________________________________________________
dense_2 (Dense)              (None, 100, 1024)         1049600   
_________________________________________________________________
dropout_2 (Dropout)          (None, 100, 1024)         0         
_________________________________________________________________
dense_3 (Dense)              (None, 100, 1024)         1049600   
_________________________________________________________________
dropout_3 (Dropout)          (None, 100, 1024)         0         
_________________________________________________________________
encoded (Dense)              (None, 100, 1024)         1049600   
_________________________________________________________________
lambda_2 (Lambda)            (None, 100, 1024, 1, 1)   0         
_________________________________________________________________
conv3d_3 (Conv3D)            (None, 81, 1, 1, 64)      1310784   
_________________________________________________________________
zero_padding3d_3 (ZeroPaddin (None, 100, 1, 1, 64)     0         
_________________________________________________________________
up_sampling3d_1 (UpSampling3 (None, 200, 1, 1, 64)     0         
_________________________________________________________________
up_sampling3d_2 (UpSampling3 (None, 400, 1, 1, 64)     0         
_________________________________________________________________
conv3d_4 (Conv3D)            (None, 400, 1, 1, 912)    1168272   
_________________________________________________________________
lambda_3 (Lambda)            (None, 400, 912)          0         
_________________________________________________________________
lambda_4 (Lambda)            (None, 400, 48, 19)       0         
_________________________________________________________________
lambda_5 (Lambda)            (None, 400, 48, 19, 1)    0         
_________________________________________________________________
unpad (Lambda)               (None, 320, 48, 19, 1)    0         
=================================================================
Total params: 6,534,224
Trainable params: 6,534,224
Non-trainable params: 0
_________________________________________________________________
